src/Documents/итБлокировкаТоваровКПродажеНаКассе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>итБлокировкаТоваровКПродажеНаКассе</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.итСостояниеБлокировкиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокировкаРазблокировка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.итСостояниеБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Форматы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/итСостояниеБлокировкиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>итСостояниеБлокировкиТовара</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.итСостояниеБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/итБлокировкаТоваровКПродажеНаКассе/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//МассивПодразделений = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
	//Если МассивПодразделений.Количество() = 0 Тогда
	//	МассивПодразделений.Добавить(ПодразделениеКомпании);
	//КонецЕсли;
	
	Если Форматы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивФорматы = Форматы.ВыгрузитьКолонку("Формат");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФорматыКатегорий.Ссылка КАК Формат,
		|	ПодразделенияКомпании.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.ФорматыКатегорий КАК ФорматыКатегорий
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|		ПО ФорматыКатегорий.Ссылка = ПодразделенияКомпании.ФорматыАссортимента
		|			И (ПодразделенияКомпании.Ссылка В ИЕРАРХИИ (&РабПодразделения))
		|			И (ПодразделенияКомпании.ПометкаУдаления = ЛОЖЬ)
		|			И (НЕ ПодразделенияКомпании.Ссылка В ИЕРАРХИИ (&Выведенные))		
		|ГДЕ
		|	ФорматыКатегорий.Ссылка В(&МассивФорматов)
		|	И НЕ ПодразделенияКомпании.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МассивФорматов",   МассивФорматы);
	Запрос.УстановитьПараметр("РабПодразделения", Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	Запрос.УстановитьПараметр("Выведенные", Справочники.ПодразделенияКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч","Выведенные"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.итСостояниеБлокировкиТовара.Записывать = Истина;
	Движ = Движения.итСостояниеБлокировкиТовара;
	массРегистрации = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для Каждого стрНоменклатура Из Товары Цикл
			
			НаборЗаписей = Движ.Добавить();
			НаборЗаписей.Период                           = Дата;
			НаборЗаписей.ПодразделениеКомпании            = ВыборкаДетальныеЗаписи.Подразделение;
			НаборЗаписей.Номенклатура     				  = стрНоменклатура.Номенклатура;
			НаборЗаписей.Состояние 						  = БлокировкаРазблокировка;
			НаборЗаписей.СрокДействия                     = СрокДействия;
			
			Если массРегистрации.Найти(стрНоменклатура.Номенклатура) = НЕОПРЕДЕЛЕНО Тогда
				массРегистрации.Добавить(стрНоменклатура.Номенклатура);
			КонецЕсли;		
			
		КонецЦикла;  
	КонецЦикла;
	
	//Регистрация номенклатуры для выгрузки в оборудовании
	Для Каждого Номенклатура Из массРегистрации Цикл
		ОбНом = Номенклатура.ПолучитьОбъект();
		ОбНом.Записать();		
	КонецЦикла;


КонецПроцедуры

// Модуль объекта документа "Поступление товаров"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(СрокДействия) Тогда
		МаксимальнаяДата    = Дата("20990101");
		СрокДействия = МаксимальнаяДата;
	КонецЕсли;

	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Установим параметры проверки документа

#КонецОбласти

#КонецЕсли
